STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_dac.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_dac.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for DAC peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is recommended to read the LPBAM_Utility_GettingStarted.html document, available at the root of LPBAM utility
      folder, prior to any LPBAM application development start.

    *** Driver description ***
    ==========================
    [..]
      This section provide description of the driver files content (refer to LPBAM_Utility_GettingStarted.html document
      for more information)

    [..]
      This LPBAM modules deals with the peripheral instances that support autonomous mode.
      It is composed of 3 files :
          (+) stm32_adv_lpbam_dac.c file
              (++) This file provides the implementation of the advanced LPBAM DAC functions.
          (+) stm32_adv_lpbam_dac.h file
              (++) This file is the header file of stm32_adv_lpbam_dac.c. It provides advanced LPBAM DAC functions
                   prototypes and the declaration of their needed exported types and structures.
          (+) STM32xx/stm32_platform_lpbam_dac.h file
              (++) This header file contains all defines to be used on applicative side.
                   (+++) STM32xx stands for the device supporting LPBAM sub-system.

    *** Driver functions model ***
    ==============================
    [..]
      This section precises this module supported advanced functions model (refer to LPBAM_Utility_GettingStarted.html
      document for function model definition).

    [..]
      This driver provides 3 model of APIs :
          (+) ADV_LPBAM_{Module}_{Mode}_SetConfigQ() : provides one peripheral configuration queue.
          (+) ADV_LPBAM_{Module}_{Mode}_SetDataQ() : provides one peripheral data transfer queue.
          (+) ADV_LPBAM_{Module}_{Mode}_SetFullQ() : provides one peripheral configuration and one data transfer queue.

    *** Driver features ***
    =======================
    [..]
      This section describes this LPBAM module supported features.

    [..]
      This driver provides services covering the LPBAM management of the following DAC features :
          (+) Configures the DAC peripheral conversion.
          (+) Starts the DAC peripheral conversion.
          (+) Configures and starts the DAC peripheral conversion.

    *** Functional description ***
    ==============================
    [..]
      This section describes the peripheral features covered by this LPBAM module.

    [..]
      The output of this driver is a queue to be executed by a DMA channel in applicative side.

      The DAC peripheral is configured and started.
      The DAC conversion hardware trigger signal is configurable.
      The DAC input data is stored in a buffer then sent by a DMA channel to be converted in an analog output signal.

    *** Driver APIs description ***
    ===============================
    [..]
      This section provides LPBAM module exhaustive APIs description without considering application user call sequence.
      For user call sequence information, please refer to 'Driver user sequence' section below.

    [..]
      Use ADV_LPBAM_DAC_Conversion_SetConfigQ() API to build a linked-list queue that configures the DAC
      peripheral according to parameters in the LPBAM_DAC_ConfigAdvConf_t structure.
      The configuration parameters are :
          (+) DAC_Trigger : Specifies the DAC source trigger.
                            This parameter can be a value of @ref DAC_trigger_selection.

    [..]
      Use ADV_LPBAM_DAC_Conversion_SetDataQ() API to build a linked-list queue that configures data transfer
      according to parameters in the LPBAM_DAC_DataAdvConf_t structure.
      The configuration parameters are :
          (+) Alignment : Specifies the DAC alignment.
                          This parameter can be a value of @ref LPBAM_DAC_DataAlignment.
          (+) pData     : Specifies the source buffer of data .
          (+) Size      : Specifies the size of pData.

      The data transfer default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_WORD.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_WORD.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For TrustZone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For TrustZone devices)
      The data transfer configuration can be customized using ADV_LPBAM_Q_SetDataConfig() after
      ADV_LPBAM_DAC_Conversion_SetDataQ(). The ADV_LPBAM_Q_SetDataConfig() is in the module stm32_adv_lpbam_common.c.
      Because of the HW implementation, the following parameters should be kept at default value:
          (+) DestInc           : DMA_DINC_FIXED.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_WORD.

    [..]
      Use ADV_LPBAM_DAC_Conversion_SetFullQ() API to build a linked-list queue that configures DAC peripheral and
      configures data transfer according to parameters in LPBAM_DAC_FullAdvConf_t structure.
      The configuration parameters are :
          (+) DAC_Trigger : Specifies the DAC source trigger.
                            This parameter can be a value of @ref DAC_trigger_selection.
          (+) Alignment   : Specifies the DAC alignment.
                            This parameter can be a value of @ref LPBAM_DAC_DataAlignment
          (+) pData       : Specifies the source buffer of data .
          (+) Size        : Specifies the size of pData.

