STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_dac.c
      The data transfer default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_WORD.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_WORD.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For TrustZone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For TrustZone devices)
      The data transfer configuration can be customized using ADV_LPBAM_Q_SetDataConfig() after
      ADV_LPBAM_DAC_Conversion_SetFullQ(). The ADV_LPBAM_Q_SetDataConfig() is in the module stm32_adv_lpbam_common.c.
      Because of the HW implementation, the following parameters should be kept at default value:
          (+) DestInc           : DMA_DINC_FIXED.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_WORD.

    [..]
      These API must be called when the DAC is initialized.
           (+) Recommended DAC channel initialization sequence
               (++) Call HAL_DAC_Init() to initialize the DAC. (Mandatory)
               (++) Call HAL_DAC_ConfigChannel() to configure selected channel. (Mandatory)
                    Configuration parameters can be :
                    (+++) DAC_HighFrequency           : DAC_HIGH_FREQUENCY_INTERFACE_MODE_DISABLE. (Mandatory)
                    (+++) DAC_DMADoubleDataMode       : DISABLE.
                    (+++) DAC_SignedFormat            : DISABLE.
                    (+++) DAC_Trigger                 : DISABLE.
                    (+++) DAC_OutputBuffer            : DAC_OUTPUTBUFFER_DISABLE.
                    (+++) DAC_ConnectOnChipPeripheral : DAC_CHIPCONNECT_BOTH.
                    (+++) DAC_UserTrimming            : DAC_TRIMMING_USER.
                    (+++) DAC_TrimmingValue           : 16U.
                    (+++) DAC_SampleAndHold           : DAC_SAMPLEANDHOLD_ENABLE. (Mandatory value)
                    Sample and hold mode is mandatory in stop mode and its configuration parameters can be :
                    (+++) DAC_SampleTime  : 10U.
                    (+++) DAC_HoldTime    : 20U.
                    (+++) DAC_RefreshTime : 5U.
               (++) Call HAL_DACEx_SetConfigAutonomousMode() to enable the autonomous mode. (Mandatory)
                    Autonomous mode parameters can be :
                    (+++) AutonomousModeState : DAC_AUTONOMOUS_MODE_ENABLE. (Mandatory value)
               (++) Call __HAL_DAC_ENABLE_IT() to enable error interrupts.
                    DAC interrupts can be :
                    (+++) DAC_IT_DMAUDR1 : DMA underrun error for DAC channel 1.
                    (+++) DAC_IT_DMAUDR2 : DMA underrun error for DAC channel 2.

    *** Driver user sequence ***
    ============================
    [..]
      This section provides the steps to follow to build an LPBAM application based on HAL/LL and LPBAM drivers. (refer
      to LPBAM_Utility_GettingStarted.html for linked-list feature description).

    [..]
      This driver user sequence is :
          (+) Initialize the DAC (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_DAC_EnableDMARequests() to enable DAC DMA requests. (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Single API making configuration and data setup :
                   (+++) Call, when needed, ADV_LPBAM_DAC_Conversion_SetFullQ(). (Mandatory)
              (++) Two APIs making configuration and data setup separately :
                   (+++) Call, when needed, ADV_LPBAM_DAC_Conversion_SetConfigQ() and/or
                         ADV_LPBAM_DAC_Conversion_SetDataQ(). (Mandatory)
          (+) Call, optionally, ADV_LPBAM_Q_SetTriggerConfig() in stm32_adv_lpbam_common.c to add hardware trigger
              condition for executing of ADV_LPBAM_DAC_Conversion_SetConfigQ(), ADV_LPBAM_DAC_Conversion_SetDataQ() or
              ADV_LPBAM_DAC_Conversion_SetFullQ() output queue.
          (+) Call, optionally, ADV_LPBAM_Q_SetCircularMode() in stm32_adv_lpbam_common.c to circularize your
              linked-list queue for infinite scenarios cases.
          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode. (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power mode, it blocks the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)

    *** Recommendations ***
    =======================
    [..]
      This section provides tips and tricks to consider while using LPBAM module drivers to build a user application.

    [..]
      For memory optimization purpose, when a re-configuration is necessary, it's recommended to use
      ADV_LPBAM_DAC_Conversion_SetFullQ() instead of ADV_LPBAM_DAC_Conversion_SetConfigQ() then
      ADV_LPBAM_DAC_Conversion_SetDataQ().

    [..]
      For memory optimization purpose, when no re-configuration is necessary, it's recommended to use
      ADV_LPBAM_DAC_Conversion_SetDataQ().

    [..]
      It's forbidden to call ADV_LPBAM_DAC_Conversion_SetConfigQ() or ADV_LPBAM_DAC_Conversion_SetFullQ() on DAC
      channelx when DAC channelx or DAC channely is operating.

    [..]
      It's allowed to call ADV_LPBAM_DAC_Conversion_SetDataQ() by two different linked-list queues executed
      simultaneously for 2 different channel.

    [..]
      It's forbidden to execute simultaneously the same linked-list queue with different DMA channels.

    *** Driver status description ***
    =================================
    [..]
      This section provides reported LPBAM module status.

