STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_dac.c
    [..]
      This advanced module reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when any error is detected.

    @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_lpbam.h"

#ifdef LPBAM_DAC_MODULE_ENABLED

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup DAC_Advanced DAC_Advanced
  * @brief    DAC Advanced LPBAM module driver
  * @{
  */

/** @defgroup LPBAM_DAC_Advanced_Exported_Functions LPBAM DAC Advanced Exported Functions
  * @{
  */

/**
  * @brief  Build DMA linked-list queue to setup the configuration of DAC conversion according to parameters in
  *         LPBAM_DAC_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a DAC_TypeDef structure that selects DAC instance.
  * @param  Channel      : [IN]  Specifies the DAC channel.
  *                              This parameter can be a value of @ref LPBAM_DAC_Channel.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pConfig      : [IN]  Pointer to a LPBAM_DAC_ConfigAdvConf_t structure that contains conversion configuration
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_DAC_ConvConfigDesc_t structure that contains conversion
  *                              configuration descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_DAC_Conversion_SetConfigQ(DAC_TypeDef                *const pInstance,
                                                   uint32_t                   Channel,
                                                   LPBAM_DMAListInfo_t        const *const pDMAListInfo,
                                                   LPBAM_DAC_ConfigAdvConf_t  const *const pConfig,
                                                   LPBAM_DAC_ConvConfigDesc_t *const pDescriptor,
                                                   DMA_QListTypeDef           *const pQueue)
{
  LPBAM_DAC_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;

  /*
   *               ######## Disable and configure DAC ########
   */

  /* Set DAC instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_DAC_CONFIG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[0U];

  /* Set DAC configuration */
  config_node.Config.State               = DISABLE;
  config_node.Config.Channel             = Channel;
  config_node.Config.DAC_Trigger         = pConfig->DAC_Trigger;

  /* Fill node configuration */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect configuration node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }


  /*
   *               ######## Enable DAC ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.pSrcVarReg  = &pDescriptor->pReg[1U];

  /* Set DAC configuration */
  config_node.Config.State         = ENABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[1U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect configuration node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[1U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build DMA linked-list queue to setup the data DAC conversion according to parameters in
  *         LPBAM_DAC_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a DAC_TypeDef structure that selects DAC instance.
  * @param  Channel      : [IN]  Specifies the DAC channel.
  *                              This parameter can be a value of @ref LPBAM_DAC_Channel.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pData        : [IN]  Pointer to a LPBAM_DAC_DataAdvConf_t structure that contains conversion data nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_DAC_ConvDataDesc_t structure that contains conversion data
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_DAC_Conversion_SetDataQ(DAC_TypeDef              *const pInstance,
                                                 uint32_t                 Channel,
                                                 LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                                 LPBAM_DAC_DataAdvConf_t  const *const pData,
                                                 LPBAM_DAC_ConvDataDesc_t *const pDescriptor,
                                                 DMA_QListTypeDef         *const pQueue)
{
  LPBAM_DAC_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;

