STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_dac.c
  /*
   *               ######## DAC data node ########
   */

  /* Set DAC instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_DAC_DATA_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;

  /* Set DAC data configuration */
  config_node.Config.Channel             = Channel;
  config_node.Config.Alignment           = (uint8_t)pData->Alignment;
  config_node.NodeDesc.pBuff             = (uint32_t *)pData->pData;
  config_node.Config.Size                = pData->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect data node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build DMA linked-list queue to setup the configuration and the data DAC conversion according to parameters
  *         in LPBAM_DAC_FullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a DAC_TypeDef structure that selects DAC instance.
  * @param  Channel      : [IN]  Specifies the DAC channel.
  *                              This parameter can be a value of @ref LPBAM_DAC_Channel.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pFull        : [IN]  Pointer to a LPBAM_DAC_FullAdvConf_t structure that contains conversion full nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_DAC_ConvFullDesc_t structure that contains conversion full
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_DAC_Conversion_SetFullQ(DAC_TypeDef              *const pInstance,
                                                 uint32_t                 Channel,
                                                 LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                                 LPBAM_DAC_FullAdvConf_t  const *const pFull,
                                                 LPBAM_DAC_ConvFullDesc_t *const pDescriptor,
                                                 DMA_QListTypeDef         *const pQueue)
{
  LPBAM_DAC_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;

  /*
   *               ######## Disable and configure DAC ########
   */

  /* Set DAC instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_DAC_CONFIG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[0U];

  /* Set DAC configuration */
  config_node.Config.State               = DISABLE;
  config_node.Config.Channel             = Channel;
  config_node.Config.DAC_Trigger         = pFull->DAC_Trigger;

  /* Fill node configuration */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect configuration node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }


  /*
   *               ######## Enable DAC ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.pSrcVarReg  = &pDescriptor->pReg[1U];

  /* Set DAC configuration */
  config_node.Config.State         = ENABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[1U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect configuration node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[1U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }


  /*
   *               ######## DAC data node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_DAC_DATA_ID;

  /* Set DAC data configuration */
  config_node.Config.Alignment         = (uint8_t)pFull->Alignment;
  config_node.NodeDesc.pBuff           = (uint32_t *)pFull->pData;
  config_node.Config.Size              = pFull->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_DAC_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[2U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect data node to DAC Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[2U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the DAC DMA requests.
  * @param  pInstance    : [IN]  Pointer to a DAC_TypeDef structure that selects DAC instance.
  * @param  Channel      : [IN]  Specifies the DAC channel.
  *                              This parameter can be a value of @ref LPBAM_DAC_Channel.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_DAC_EnableDMARequests(DAC_TypeDef *const pInstance,
                                               uint32_t    Channel)
{
  /* Check channel index */
  if (Channel == LPBAM_DAC_CHANNEL_1)
  {
    /* Enable DMA requests for DAC channel 1 */
    pInstance->CR |= LPBAM_DAC_CHANNEL1_DMAEN;

    /* Enable DAC channel 1 */
    pInstance->CR |= DAC_CR_EN1;
  }
  else
  {
    /* Enable DMA requests for DAC channel 2 */
    pInstance->CR |= LPBAM_DAC_CHANNEL2_DMAEN;

    /* Enable DAC channel 2 */
    pInstance->CR |= DAC_CR_EN2;
  }

  return LPBAM_OK;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPBAM_DAC_MODULE_ENABLED */
